#!/usr/bin/rvtlw
 
10020 :-------------------------------------------------------------
10030 : RvtlWiki (render.cgi)
10040 : version : 2.07 (32bit) 2025/01/31
10050 : Copyright (C) 2005-2025
10060 :   Jun Mizutani <mizutani.jun@nifty.ne.jp> http://www.mztn.org/
10070 : & Toshio Moritake <odinsroom@gmail.com> http://www.odin.hyork.net/
10080 :     RvtlWiki may be copied under the terms of the
10090 :     GNU General Public License.
10100 :------------------------------------------------------------
10110    M=1024             : 最大ページサイズ(KB)
10120    *=*+(M*1536)       : メモリ拡張
10130    z=&                : heap top
10140    Y=z z=z+256        : Debug Switch
10150    Z=z z=z+256        : Buffer
10160    T=z z=z+(M*1024)   : text
10170    K=0
10180 :
10190    [=0                : 範囲チェックOFF
10200    Y*=\2              : 時間計測オプション
10210    ;=Y(0)<>0 !=^TimerStart
10220    Z*=\0 x=Z          : Wikiテキストファイル名
10230    !=^TextRead        : Wikiテキスト読み込み
10240    x={ y=}            : テキストデータ範囲設定
10250    !=^RendWikiData
10260    ;=Y(0)<>0 "<hr /><p> " !=^TimerStop "</p><hr />" /
10270    [=1
10280    #=-1
10290 :
10300 :-------------------------------------------------
10310 : テキストリード x=FileName, T=BufferTop
10320 : r=bytes read
10330 :-------------------------------------------------
10340 ^TextRead
10350    {=T
10360    )*=x            : read file
10370    r=}-{
10380 ]
10390 :
10400 :-------------------------------------------------
10410 : 部分文字列の比較   length(x) <= length(y)
10420 :
10430 : x の示す文字列が y の示す文字列と一致したら
10440 : r=文字列末または初めて異なる文字の位置
10450 : 一致していなければ r=0 を返す
10460 :-------------------------------------------------
10470 ^CompareStr
10480     +if
10490     i=-1
10500     f=0
10510     @
10520       i=i+1
10530       ;=(x(i)=y(i))&(x(i)=0) f=1  : 発見
10540       ;=x(i)<>y(i) f=2            : 違う
10550     @=((x(i)=0)|(f<>0))
10560     ;=i>0 ;=f=1 r=i
10570     ;=(x(i)=0)&(f=2)) r=i
10580     ;=(x(i)<>0) r=0
10590     -fi
10600 ]
10610 :
10620 :-----------------------------------------
10630 : 時間を測定するプログラムにマージして実行
10640 :   !=^TimerStart から !=^TimerStop の時間
10650 :   #=-1 の前に !=^TimerStop を置く事
10660 :   変数スタックに値を積むためすべての変数
10670 :   は影響を受けない。
10680 :-----------------------------------------
10690 :----------------------------------
10700 : 時間計測開始
10710 :----------------------------------
10720 ^TimerStart
10730     +=_  +=%
10740 ]
10750 :
10760 :----------------------------------
10770 : 時間計測終了、経過時間表示
10780 :----------------------------------
10790 ^TimerStop
10800     -UT X=_ Y=%
10810     D=X-T F=Y-U
10820     ;=(F<0) D=D-1 F=F+1000000
10830     "  time:" ?=D "." ?[6]=F "sec" /
10840 ]
10850 :
10860 :-------------------------------------------------
10870 : 文字列長の取得
10880 :
10890 : x に文字列を指定、ｒに文字数が返る
10900 :-------------------------------------------------
10910 ^StrLen
10920    x*=x
10930    r=%
10940 ]
10950 :
10960 :-------------------------------------------------
10970 : Copy String
10980 :
10990 :  x() : string1 (source)
11000 :  y() : string2 (destinnation)
11010 : return
11020 :  r   : length
11030 :-------------------------------------------------
11040 ^CopyStr
11050     y*=x
11060     r=%
11070 ]
11080 :
11090 :======================================================================
11100 : ----------------------------------------------------------
11110 :  Readering Wiki File Wikiファイルの出力
11120 :     (in) x : Wikiデータの開始アドレス
11130 :     (in) y : Wikiデータの終了アドレス
11140 : ----------------------------------------------------------
11150 ^RendWikiData
11160     +AEM
11170     A=x E=y M=20000
11180     !=^outputData
11190     -MEA
11200 ]
11210 :
11220 : ----------------------------------------------------------
11230 :  コメント欄の表示
11240 : ----------------------------------------------------------
11250 ^PutComment
11260    / "<div id='comment'>" /
11270    "<form action='rvtlwiki.cgi' method='post' ><fieldset>" /
11280    "<input type='hidden' name='page' value='" $*=\1 "'>" /
11290    : "<legend></legend> " /
11300    ;=K=1 "<small>コメント − ページの最上部に追加されます。</small>"
11310    ;=K=1 "<input type=submit name='AddTop' value='書き込み' ><br />" /
11320    ;=K=2 "<small> − ページの最下部に追加されます。</small>"
11330    ;=K=2 "<input type='submit' name='AddBottom' value='書き込み'><br />"
11340    "<textarea cols='80' rows='8' name='msg' >" /
11350    "</textarea><br />" /
11360    "</fieldset></form>" / "</div>"
11370    "<p>" "</p>" /
11380    Q=1
11390 ]
11400 :
11410 : ----------------------------------------------------------
11420 :  Output Data データ出力
11430 :     (in) A : ファイルの先頭アドレス
11440 :     (in) E : ファイルの終了アドレス
11450 :     (in) M : 最大行数
11460 : ----------------------------------------------------------
11470 ^outputData
11480     +bcdfijlmpszBCDGHJLMPQSTUW
11490     l=z z=z+(4*M)               : l[] 行頭アドレス
11500     p=z z=z+(4*M)
11510     s=z z=z+(4*M)               : s[] 行の文字数
11520     m=z z=z+(1*M)               : m() モード
11530     c=z z=z+(1*M)               : c() 見出しレベル、<pre>の種類など
11540     v=z z=z+(1*M)               : v() スキャンフラグ
11550     E=E+1 E(0)=10 B=0 D=0 G=0 T=0 U=0 V=0
11560     i=0 j=0 f=0 M=0
11570     :
11580   :Wikiデータ全体をスキャンして行数、行先頭、行長などを求める
11590     b=0 : pre内なら b>0
11600     i=A,E                                 : 1文字ずつのループ
11610       d=i(0)                              : 1文字取得
11620       ;=(f=0) f=1 j=j+1 L=i v(j)=0        : j=行番号 L=行頭アドレス
11630       ;=(d='[') ;=(i(1)='[') v(j)=1       : URL quote
11640       ;=(d='h') ;=(i(1)='t') ;=(i(2)='t') ;=(i(3)='p') v(j)=1 : http発見
11650       ;=(d=$27) ;=(i(1)=$27) v(j)=2       : '' 発見 (太字)
11660       ;=(d=13) i(0)=0                     : CR なら 0 に置き換え
11670       : 行末(LF)ならば 1行を解析し結果を行属性配列に保存
11680       ;=(d=10) f=0 i(0)=0 W=M !=^analyze
11690       ;=(d=10) l[j]=L p[j]=P s[j]=i-L m(j)=M c(j)=C
11700     @=i+1
11710     J=0 H=0
11720     ;=K<>0 !=^PutComment : analyze でコメント記入欄出力
11730   :目次の生成
11740     / "<div id='toc'>" /
11750     B=0
11760     i=1,j
11770       ;=(m(i)='B') B=1 : pre の内側は見出し無し
11780       ;=(m(i)='b') B=0
11790       ;=(m(i)='C')&(B=0) C=c(i) P=p[i] !=^setIndexRow
11800     @=i+1
11810     @
11820       ;=C>0  .=C*2 "</ul>" / C=C-1
11830     @=(C=0)
11840     "</div>" / / "<div id='main'>" /
11850   :出力
11860     J=0 M=0
11870     i=1,j                                 : 1行ずつのループ
11880       W=M
11890       L=l[i] P=p[i] S=s[i] M=m(i) C=c(i) Q=0 V=v(i)
11900       !=^outputOneLine
11910     @=i+1
11920   :Clean Up
11930     !=^setTableEndTag
11940     !=^setDefEndTag
11950     !=^setListEndTag
11960     !=^setParaEndTag
11970     !=^setCodeEndTag
11980     "</div>" /
11990   ^_outputData
12000     -WUTSQPMLJHGDCBzspmljifdcb
12010 ]
12020 :
12030 : ----------------------------------------------------------
12040 :  Analyze Line １行解析 (解析のみで出力はなし)
12050 :     (in) L : アクセス中の行の先頭アドレス
12060 :     (io) M : アクセス中の行のモード
12070 :     (io) W : 前のモード
12080 :     (io) C : カウンタ(Mの数値属性)
12090 :     (io) P : アクセス中の行のカーソル位置
12100 : ----------------------------------------------------------
12110 ^analyze
12120     +ic
12130     M='G' C=0 c=0
12140     : 行頭の1文字をチェック
12150     ;=(L(0)='-') #=^_pre_hr                            : pre か hr
12160     ;=b>0        #=^_endAnalyze           : pre 内なら行頭の記号は無視
12170     ;=(L(0)=$e2) #=^_jp_header                         : 見出し
12180     ;=(L(0)>'?') #=^_endAnalyze
12190     ;=(L(0)=0)   M='E' #=^_endAnalyze                  : 空行
12200     ;=(L(0)=' ') #=^_space #=^_endAnalyze              : 空白pre
12210     ;=(L(0)='*') #=^_header                            : 見出し
12220     ;=(L(0)=':') M='D' #=^_endAnalyze
12230     ;=(L(0)='.') M='T' #=^_endAnalyze
12240     ;=(L(0)=',') M='T' #=^_endAnalyze
12250     ;=(L(0)='?') ;=(L(1)='T') K=1 M='M' #=^_endAnalyze : 先頭コメント
12260     ;=(L(0)='?') ;=(L(1)='B') K=2 M='M' #=^_endAnalyze : 末尾コメント
12270     #=^_endAnalyze
12280   : <pre> または <hr /> または <ul>
12290   ^_pre_hr
12300     i=0 @ i=i+1 @=((L(i)<>'-')|(i>5))
12310     : pre内で開始タグと同じレベルならばpre終了
12320     ;=(L(i)=')')&(b=i) M='b' b=0 C=i #=^_endAnalyze
12330     : pre タグ内ならば何もしない
12340     ;=b>0 #=^_endAnalyze
12350     : pre タグ内でなければ pre 開始
12360     ;=(L(i)='(') M='B' b=i C=i #=^_endAnalyze
12370     ;=L(i)='.' M='R' C=i #=^_endAnalyze                : 改行
12380     ;=(i=4) M='L' C=i #=^_endAnalyze                   : 水平線
12390     ;=(i<4) M='U' C=i #=^_endAnalyze                   : リスト
12400     #=^_endAnalyze
12410   : 見出し
12420   ^_header
12430     i=0 @ i=i+1 @=((L(i)<>'*')|(i>6))
12440     ;=(i<7) M='C' C=i #=^_endAnalyze
12450     #=^_endAnalyze
12460   ^_jp_header
12470     ;=(L(1)=$98)&(L(2)=$85) M='C' C=1 c=3 #=^_endAnalyze : BLACK STAR
12480     ;=(L(1)=$96)&(L(2)=$A0) M='C' C=2 c=3 #=^_endAnalyze : BLACK SQUARE
12490     ;=(L(1)=$97)&(L(2)=$8F) M='C' C=3 c=3 #=^_endAnalyze : BLACK CIRCLE
12500     ;=(L(1)=$97)&(L(2)=$86) M='C' C=4 c=3 #=^_endAnalyze : BLACK DIAMOND
12510     ;=(L(1)=$96)&(L(2)=$B2) M='C' C=5 c=3 #=^_endAnalyze : BLACK UP TRIANGLE
12520     ;=(L(1)=$98)&(L(2)=$86) M='C' C=6 c=3 #=^_endAnalyze : WHITE STAR
12530     #=^_endAnalyze
12540   : 空白
12550   ^_space
12560     i=0 @ i=i+1 @=((L(i)<>' ')|(i>4))
12570     : 空白2つ以上で前がリストなら継続行
12580     ;=(i>=2)&((W='U')|(W='u')) M='u' #=^_endAnalyze    : <li>の継続行
12590     : 空白2つ以下なら通常行
12600     ;=(i<3) #=^_endAnalyze
12610     : 空白3つ以上なら整形済み(verbatim-code)
12620     M='Y' C=2 #=^_endAnalyze
12630   ^_endAnalyze
12640     ;=c>0 P=L+c
12650     ;=c=0 P=L+C
12660     -ci
12670 ]
12680 :
12690 : ----------------------------------------------------------
12700 :  OutPut One Line １行出力
12710 :     (in) L : アクセス中の行の先頭アドレス
12720 :     (in) M : アクセス中の行のモード
12730 :     (io) W : 直前の行のモード
12740 :     (in) S : アクセス中の行の長さ
12750 :     (io) P : アクセス中の行のカーソル位置
12760 :     (lc) Q : 行出力済みフラグ (1:YES, 0:NO)
12770 : ----------------------------------------------------------
12780 ^outputOneLine
12790   :Clean Up
12800     ;=(M<>'T') !=^setTableEndTag
12810     ;=(M<>'D') !=^setDefEndTag
12820     ;=(M<>'u') !=^setLIEndTag
12830     ;=(M<>'U')&(M<>'u') !=^setListEndTag
12840     ;=(M<>'G') !=^setParaEndTag
12850     ;=(M<>'Y') !=^setCodeEndTag
12860   :Main
12870     : "(" $=M ")"
12880     ;=(M='B') !=^setOpenVerb     #=^_outputOneLine
12890     ;=(M='b') !=^setCloseVerb    #=^_outputOneLine
12900     ;=(M='R') !=^setNewLine      #=^_outputOneLine
12910     ;=(M='E')&(W='E') !=^setNewLine    #=^_outputOneLine
12920     ;=(M='Y') !=^setCodeTag      #=^_outputOneLine
12930     ;=(B)     P=L                #=^_outputOneLine
12940     ;=(M='G') !=^setParaRow      #=^_outputOneLine
12950     ;=(M='U') !=^setListItemRow  #=^_outputOneLine
12960     ;=(M='u')&(B<2) !=^setListContinue #=^_outputOneLine
12970     ;=(M='L') !=^setHoriRuleTag  #=^_outputOneLine
12980     ;=(M='T') !=^setTableRow     #=^_outputOneLine
12990     ;=(M='D') !=^setDefRow       #=^_outputOneLine
13000     ;=(M='C') !=^setCaptionTag   #=^_outputOneLine
13010     ;=(M='M') Q=1
13020   ^_outputOneLine
13030     ;=(Q=0) !=^outputLineData /
13040 ]
13050 :
13060 : ----------------------------------------------------------
13070 :  行データの残りを標準出力に書き出し
13080 :     (in) V : URLなどが含まれていそうな行
13090 :     (in) P : アクセス中の行のカーソル位置
13100 : ----------------------------------------------------------
13110 ^outputLineData
13120     ;=(P(0)=0) #=^_outputLineData
13130     ;=(V=0)|(B=3) $*=P #=^_outputLineData
13140     @
13150       ;=(V&2)<>0 ;=(P(0)=$27)&(P(1)=$27) !=^quoteString #=^old00
13160       ;=(P(0)='[')&(P(1)='[')&(P(2)='[')&(P(3)='[') !=^insertVid #=^old00
13170       ;=(P(0)='[')&(P(1)='[')&(P(2)='[') !=^insertImg #=^old00
13180       ;=(P(0)='[')&(P(1)='[') !=^quoteURL #=^old00
13190       ;=(P(0)='h')&(P(1)='t')&(P(2)='t')&(P(3)='p') !=^quoteURL2 #=^old00
13200       $=P(0)
13210      ^old00
13220       P=P+1
13230     @=(P(0)=0)
13240   ^_outputLineData
13250 ]
13260 :
13270 : ----------------------------------------------------------
13280 : URL引用
13290 :  (in) P : 候補文字列の先頭
13300 : ----------------------------------------------------------
13310 ^quoteURL
13320     +tu
13330     t=P+2
13340     u=t-1
13350     @ u=u+1 @=((u(0)='|')|(u(0)=']')|(u(0)=0))
13360     u=u+1 ;=u(-1)=']' "[" -tu ]
13370     "<a href='"
13380     @ $=u(0) u=u+1 @=((u(0)=']')|(u(0)=0))
13390     u=u+1
13400     "'>"
13410     @ $=t(0) t=t+1 @=((t(0)='|')|(t(0)=0))
13420     "</a>"
13430     P=u
13440     -ut
13450 ]
13460 :
13470 : ----------------------------------------------------------
13480 : http: から空白の前までをリンクとして出力
13490 : (in) P : 候補文字列の先頭
13500 : ----------------------------------------------------------
13510 ^quoteURL2
13520     +pi
13530     p=P+4
13540     ;=p(0)<>':' "h" -ip ]
13550     p=p+1
13560     "<a href='http:"
13570     @
13580       $=p(0)
13590       p=p+1
13600     @=((p(0)=' ')|(p(0)=0))
13610     "'>"
13620     i=P
13630     @
13640       $=i(0)
13650       i=i+1
13660     @=(i=p)
13670     "</a>"
13680     P=p
13690     -ip
13700 ]
13710 :
13720 : ----------------------------------------------------------
13730 : 画像挿入
13740 :  (in) P : 候補文字列の先頭
13750 :  (in) E : テキスト最終位置
13760 : ----------------------------------------------------------
13770 ^insertImg
13780     +t
13790     t=P+3
13800     "<img alt='"
13810     @ $=t(0) t=t+1 @=((t(0)='|')|(t(0)=0))
13820     t=t+1
13830     "' src='"
13840     @ $=t(0) t=t+1 @=((t(0)=']')|(t(0)=0))
13850     "'>"
13860     P=t+2
13870     -t
13880 ]
13890 :
13900 : ----------------------------------------------------------
13910 : ビデオ挿入
13920 :  (in) P : 候補文字列の先頭
13930 :  (in) E : テキスト最終位置
13940 : ----------------------------------------------------------
13950 ^insertVid
13960     +t
13970     t=P+4
13980     "<video controls alt='"
13990     @ $=t(0) t=t+1 @=((t(0)='|')|(t(0)=0))
14000     t=t+1
14010     "' src='"
14020     @ $=t(0) t=t+1 @=((t(0)=']')|(t(0)=0))
14030     "'>"
14040     P=t+3
14050     -t
14060 ]
14070 :
14080 : ----------------------------------------------------------
14090 : quote
14100 :  (in) P : 候補文字列の先頭
14110 :  (in) E : テキスト最終位置
14120 : ----------------------------------------------------------
14130 ^quoteString
14140     +pc
14150     p=P+2
14160     ;=p(1)=$27) c=p(0) #=^ColorString
14170     ;=p(0)=$27 #=^quote2String
14180     "<span class='quote1'>"
14190     @
14200       $=p(0)
14210       p=p+1
14220     @=(((p(0)=$27)&(p(1)=$27))|(p(0)=0))
14230     "</span>"
14240     P=p+1
14250     -cp
14260 ]
14270 ^quote2String
14280     p=P+3
14290     "<span class='quote2'>"
14300     @
14310       $=p(0)
14320       p=p+1
14330     @=(((p(0)=$27)&(p(1)=$27)&(p(2)=$27))|(p(0)=0))
14340     "</span>"
14350     P=p+2
14360     -cp
14370 ]
14380 : 文字色の指定用 span ''c' ____ ''''
14390 ^ColorString
14400     p=P+4
14410     ;=c='r' "<span class='red'>"    #=^_ColorString
14420     ;=c='g' "<span class='green'>"  #=^_ColorString
14430     ;=c='b' "<span class='blue'>"   #=^_ColorString
14440     ;=c='c' "<span class='cyan'>"   #=^_ColorString
14450     ;=c='m' "<span class='magenta'>" #=^_ColorString
14460     ;=c='y' "<span class='yellow'>" #=^_ColorString
14470     ;=c='w' "<span class='white'>"  #=^_ColorString
14480     ;=c='0' "<span class='bblack'>" #=^_ColorString
14490     ;=c='1' "<span class='bblue'>"  #=^_ColorString
14500     ;=c='2' "<span class='bgreen'>" #=^_ColorString
14510     ;=c='3' "<span class='bcyan'>"  #=^_ColorString
14520     ;=c='4' "<span class='bred'>"   #=^_ColorString
14530     ;=c='5' "<span class='bmagenta'>" #=^_ColorString
14540     ;=c='6' "<span class='byellow'>" #=^_ColorString
14550     ;=c='7' "<span class='bwhite'>" #=^_ColorString
14560     ;=c='9' "<span class='lgreen'>" #=^_ColorString
14570     ;=c='B' "<span class='iblue'>"  #=^_ColorString
14580     ;=c='G' "<span class='igreen'>" #=^_ColorString
14590     ;=c='C' "<span class='icyan'>"  #=^_ColorString
14600     ;=c='R' "<span class='ired'>"   #=^_ColorString
14610     ;=c='M' "<span class='imagenta'>" #=^_ColorString
14620     ;=c='Y' "<span class='iyellow'>" #=^_ColorString
14630     ;=c='L' "<span class='iblack'>" #=^_ColorString
14640     ;=c='W' "<span class='iwhite'>"
14650  ^_ColorString
14660     @
14670       $=p(0)
14680       p=p+1
14690     @=(((p(0)=$27)&(p(1)=$27)&(p(2)=$27)&(p(3)=$27))|(p(0)=0))
14700     "</span>"
14710     P=p+3
14720     -cp
14730 ]
14740 :
14750 : ----------------------------------------------------------
14760 :  Set Horizontal Rule Tag <hr />の出力
14770 :     (in) L : アクセス中の行の先頭アドレス
14780 :     (io) P : アクセス中の行のカーソル位置
14790 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
14800 : ----------------------------------------------------------
14810 ^setHoriRuleTag
14820     ;=P(0) P=L #=^_setHoriRuleTag
14830     "<hr />" /
14840     Q=1
14850   ^_setHoriRuleTag
14860 ]
14870 :
14880 : ----------------------------------------------------------
14890 :  Set Table End Tag </table>の出力
14900 :     (io) T : テーブルの作成中フラグ (1:YES, 0:NO)
14910 : ----------------------------------------------------------
14920 ^setTableEndTag
14930     ;=T "</table>" / T=0
14940 ]
14950 :
14960 : ----------------------------------------------------------
14970 :  Set Definition List End Tag </dl>の出力
14980 :     (io) D : 定義リストの作成中フラグ (1:YES, 0:NO)
14990 : ----------------------------------------------------------
15000 ^setDefEndTag
15010     ;=D "</dl>" / D=0
15020 ]
15030 :
15040 : ----------------------------------------------------------
15050 :  Set Paragraph Row 段落行の出力
15060 :     (io) G : 段落の作成中フラグ (1:YES, 0:NO)
15070 : ----------------------------------------------------------
15080 ^setParaRow
15090     ;=(G=0) "<p>" / G=1
15100     !=^outputLineData /
15110     Q=1
15120 ]
15130 :
15140 : ----------------------------------------------------------
15150 :  Set Paragraph End Tag </p>の出力
15160 :     (io) G : 段落の作成中フラグ (1:YES, 0:NO)
15170 : ----------------------------------------------------------
15180 ^setParaEndTag
15190     ;=G "</p>" / G=0
15200 ]
15210 :
15220 : ----------------------------------------------------------
15230 :  Set Pre End Tag </pre>の出力
15240 :     (io) W : 前のタグ
15250 : ----------------------------------------------------------
15260 ^setCodeEndTag
15270     ;=W='Y' "</pre>" /
15280 ]
15290 :
15300 : ----------------------------------------------------------
15310 :  Set List Item Row <li>行の出力
15320 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
15330 : ----------------------------------------------------------
15340 ^setListItemRow
15350     ;=(C<>U) !=^setListStartTag
15360     ;=(W='u') "</li>" /
15370     "<li>"
15380     R=1
15390 ]
15400 :
15410 : ----------------------------------------------------------
15420 :  Set List Item 継続行の出力
15430 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
15440 : ----------------------------------------------------------
15450 ^setListContinue
15460     R=1
15470 ]
15480 :
15490 : ----------------------------------------------------------
15500 :  Set List End Tag </pre>の出力
15510 :     (io) W : 前のタグ
15520 : ----------------------------------------------------------
15530 ^setLIEndTag
15540     ;=((W='U')|(W='u')) "</li>" / R=0
15550 ]
15560 :
15570 : ----------------------------------------------------------
15580 :  Set List Start Tag <ul>,</ul>の出力
15590 :     U :
15600 : ----------------------------------------------------------
15610 ^setListStartTag
15620     @
15630       ;=(C>U) U=U+1 "<ul>" /
15640       ;=(C<U) U=U-1 "</ul>" /
15650     @=(C=U)
15660 ]
15670 :
15680 : ----------------------------------------------------------
15690 :  Set List End Tag </ul>の出力
15700 :     U :
15710 : ----------------------------------------------------------
15720 ^setListEndTag
15730     ;=(U=0) #=^_setListEndTag
15740     @
15750       U=U-1 "</ul>" /
15760     @=(U=0)
15770   ^_setListEndTag
15780 ]
15790 :
15800 : ----------------------------------------------------------
15810 :  Set Verbatim Tag <pre>タグの出力
15820 :     (in) B :
15830 :     (in) C :
15840 :     (in) L : アクセス中の行の先頭アドレス
15850 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
15860 : ----------------------------------------------------------
15870 ^setOpenVerb
15880     : "(pre " ?=B "," ?=C ")"
15890     ;=((B>0)&(L(C)='(')) P=L #=^_setVerbTag
15900     ;=((B=0)&(L(C)=')')) P=L #=^_setVerbTag
15910     ;=((B>0)&(B<>C)) P=L #=^_setVerbTag
15920     ;=(C=2) "<pre class='verbatim-soft'>"   B=C / Q=1 #=^_setVerbTag
15930     ;=(C=3) "<pre class='verbatim-hard'>"   B=C / Q=1 #=^_setVerbTag
15940     ;=(C=4) "<pre class='verbatim-code'>"   B=C / Q=1 #=^_setVerbTag
15950     ;=(C=5) "<pre class='verbatim-screen'>" B=C / Q=1 #=^_setVerbTag
15960   ^_setVerbTag
15970 ]
15980 :
15990 ^setCloseVerb
16000     "</pre>" / B=0 Q=1
16010 ]
16020 :
16030 ^setNewLine
16040     "<br />" Q=1 /
16050 ]
16060 :
16070 : ----------------------------------------------------------
16080 :  Set Code Tag <pre>タグの出力
16090 :     (in) B :
16100 :     (in) C :
16110 :     (in) L : アクセス中の行の先頭アドレス
16120 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
16130 : ----------------------------------------------------------
16140 ^setCodeTag
16150     ;=(W<>'Y')&(B=0) "<pre class='verbatim-code'>" /
16160     !=^outputLineData /
16170     Q=1
16180 ]
16190 :
16200 : ----------------------------------------------------------
16210 :  Set Caption Tag <h?>タグの出力
16220 :     (in) C :
16230 :     (io) J :
16240 :     (io) Q : 行出力済みフラグ (1:YES, 0:NO)
16250 : ----------------------------------------------------------
16260 ^setCaptionTag
16270     / "<h" ?=C+1 "><a id='i" ?=J "'> </a>"
16280     "<a class='header' href='#main'>" !=^outputLineData "</a>"
16290     "</h" ?=C+1 ">" /
16300     J=J+1 Q=1
16310 ]
16320 :
16330 : ----------------------------------------------------------
16340 :  Set Table Row テーブル行の出力
16350 :     L : アクセス中の行の先頭アドレス
16360 :     P : アクセス中の行のカーソル位置
16370 :     Q : アクセス中の行の出力終了 (YES or NO)
16380 :     S : アクセス中の行の長さ
16390 :     T : テーブルの作成中フラグ
16400 : ----------------------------------------------------------
16410 ^setTableRow
16420     ;=(T=0) "<table>" / T=1
16430     :-----------------------------------------
16440     :  c : colspan 算出
16450     :  f : フィールド先頭検出用フラグ
16460     :  h : THフラグ (YES/NO)
16470     :  i : 行の処理中アドレス
16480     :  b : 行先頭
16490     :  p : フィールド先頭を記録
16500     :  n : フィールド文字長
16510     :-----------------------------------------
16520     +cfhibpn
16530     b=L h=0 f=1 n=0
16540     ;=(b(0)='.') h=1
16550     "<tr>"
16560     : 1行を1フィールドづつ処理
16570     p=b+1                           : "," または "."の次から
16580     @
16590       i=-1
16600       @
16610         i=i+1
16620       @=((p(i)=0)|(p(i)=','))
16630       p(i)=0
16640       n=i                           : フィールド末位置を記録
16650       !=^setTableCell               : pにフィールド先頭、iに文字数
16660       p=p+i+1
16670     @=(p>=(b+S))
16680     "</tr>" /
16690     Q=1                             : 行処理終了
16700     -npbihfc
16710 ]
16720 :
16730 : ----------------------------------------------------------
16740 : フィールドの連結(colspan)の検出
16750 : (in)  p : フィールド先頭
16760 : (in)  i : フィールド長
16770 : (in)  b+S : 行末のアドレス
16780 : (out) c : colspanの値
16790 : (out) i : 更新されたフィールド長
16800 : ----------------------------------------------------------
16810 ^getColSpan
16820     +xyz
16830     c=1
16840     ;=(p+n)=(b+S) #=^_getColSpan    : 最終フィールドならc=1で終了
16850     x=z z=z+3
16860     x*="=="
16870     : "==" のフィールドがなくなるまで i を増加させて読み進める
16880     @
16890       y=p+i+1                       : 次フィールド先頭を比較
16900       !=^CompareStr
16910       ;=r=0 #=^gcp00                : 異なればループ脱出
16920       i=i+r+1
16930       @
16940         ;=(p(i)=',')|(p(i)=0) f=1   : フィールド末まで進める
16950         ;=f=0 i=i+1
16960       @=(f=1)
16970       c=c+1                         : colspan++
16980       ^gcp00
16990     @=((r=0)|(p(0)=0))
17000   ^_getColSpan
17010     -zyx
17020 ]
17030 :
17040 : ----------------------------------------------------------
17050 : フィールドの連結(rowspan)の検出
17060 : (in)  p : フィールド先頭
17070 : (in)  i : フィールド文字数
17080 : (out) j : colspanの値
17090 : (out) i : フィールド文字数
17100 : ----------------------------------------------------------
17110 ^getRowSpan
17120     j=0
17130     ;=p(j)<>'|' ]
17140     j=0 @ j=j+1 @=(p(j)<>'|')
17150     p=p+j i=i-j n=i
17160 ]
17170 :
17180 : ----------------------------------------------------------
17190 : テーブルの1フィールド分のタグと内容を出力
17200 : (in) p : フィールド先頭
17210 : (in) c : colspan
17220 : (in) h : <th>フラグ
17230 : ----------------------------------------------------------
17240 ^setTableCell
17250     !=^getColSpan
17260     !=^getRowSpan
17270     +a
17280     a=0                                     : アライン検出
17290     ;=(p(0)=' ')    a=a+2                   : 左側に空白
17300     ;=(p(n-1)=' ')  a=a+1                   : 右側に空白
17310     ;=(h=1)         "<th"
17320     ;=(h=0)         "<td"
17330     ;=(a=2)         " align='right'"
17340     ;=(a=3)         " align='center'"
17350     ;=(c>1)         " colspan='" ?=c "'"
17360     ;=(j>1)         " rowspan='" ?=j "'"
17370     ">" P=p !=^outputLineData               : フィールド内容表示
17380     ;=(h=1)         "</th>"
17390     ;=(h=0)         "</td>"
17400     -a
17410 ]
17420 :
17430 : ----------------------------------------------------------
17440 :  Set Definition Row 定義リスト行の出力
17450 :     D : 定義リストの作成中フラグ (1:YES, 0:NO)
17460 : ----------------------------------------------------------
17470 ^setDefRow
17480     +ci
17490     i=0 c=0
17500     @
17510       i=i+1
17520       ;=(L(i)=':') L(i)=0 c=i
17530     @=((L(i)=0)|(c>0))
17540     ;=(c=0) !=^setDefEndTag P=L #=^_setDefRow
17550     ;=(D=0) "<dl>" / D=1
17560     P=L+1
17570     "<dt>" !=^outputLineData "</dt>"
17580     P=L+c+1
17590     "<dd>" !=^outputLineData "</dd>" /
17600     Q=1
17610   ^_setDefRow
17620     -ic
17630 ]
17640 :
17650 : ----------------------------------------------------------
17660 :  目次の出力
17670 : ----------------------------------------------------------
17680 ^setIndexRow
17690     +i
17700     ;=H<C .=C*2 "<ul>" /
17710     ;=H>C i=C @ "</ul>" / i=i+1 @=(i=H)
17720     .=C*2  "<li><a href='#i" ?=J "'>" !=^outputLineData "</a></li>" /
17730     J=J+1
17740     H=C
17750     -i
17760 ]
17770 :
#=1
~

